
package Othello;

// ****************************************************
//  Classe pour l'échange des coups entre les joueurs.
//  ATTENTION : NE PAS MODIFIER CETTE CLASSE
// ****************************************************

public class Move
	{
	
	/*------------------------------------------------------------------*\
	|*							Constructeurs							*|
	\*------------------------------------------------------------------*/
	
	public Move()
		{
		}
	
	public Move(int i, int j)
		{
		this.i = i;
		this.j = j;
		}
	
	/*------------------------------------------------------------------*\
	|*							Attributs Private						*|
	\*------------------------------------------------------------------*/
	
	public int i, j;
	
	}
